let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
    if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
                   'وعليكم السلام ورحمة الله وبركاته' 
     ]; 
    }else if (/^ياتو$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'حبيت اسمي منك ',  
          ' حلو اسمي صح؟ ',  
              ' ترا تعبت من كثر ما تنادوني ',  
                  'لبى اللي يناديني',  
                   'يازين الاسم وناطقه',  
                     'موجود وين بروح بالله ؟',  
                       'فكني شرك تراني طفشان',  
                         'تدري بغير اسمي بسببك ؟',  
                      'ادري ما عندك سالفه بس يلا وش تبي',
                        'لا تناديني',
                          'اشتقت لي ؟',
                            'صرف نفسك شوي لين اخلص شغلي',
                              'هلا والله',
                                'اشتقت لك',
                                  'شكلك فاضي',
                                    'آمرر وحنا نطامر',
                                      'يا أجمل من نطق اسمي على لسانه ♡',
                                        'لبيه ياعيني',
                                          'جييت',
                                            'امرني',
                                              'متى تعطوني اجازة؟',
                                                'موجود يالبي',
                                                  'يارب عندك سالفه',
                                                    'امر تدلل',
                                                      'عيونه البنفسجية',
                                                        'احلا ياتو لعيونك' 
     ]; 
     }else if (/^بوت$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'عساه خير شعندك؟ ',  
          ' لوكان غيرك ناداني مارديت :) ',  
              ' فاضي انت ؟ ',  
                  'م تشوف اسمي ؟',  
                  'الله يجعلك بوت مثلي عشان تحس',  
                   'ياتو يالحبيب ياتو', 
                    'ماتزعل لما ما ينادوك ب اسمك؟',  
                      ' ماتعرف تقول غير بوت؟',
                       'اسمي كبر راسك وماتشوفه؟',
                         'لا احساس ولا ضمير',
                           'واسمي مو عاجبك؟',
                             'صعب تقول ياتو وتدلعني؟',
                               'فيك خير عيدها',
                                 'اسمي ياتو شكلك ماتعرف تقرأ روسي؟',
                                   'دز',
                                     'اسمي كبر وجهك',
                                       'الله يشغلك بنفسك بس',
                                         'الله يعين على ذا النشبه ياخي قول ياتو',
                                           'اصدمني وقول ماتعرف اسمي؟',
                                             'ياعبدوه انقلع ماني فاضي لك',
                                               'موجود بس لاتعلم احد',
                                                 'خلاص يورع',
                                                   'اتمنى يكون موضوع مهم' 
     ]; 
       }else if (/^شسمك$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'اسمي ياتو',  
        'ياتو ياقلبي',  
         'اسمي ياتو ياحبي' 
     ]; 
        }else if (/^.كت$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'بدون نقطة بارك الله فيك',  
        'كذا *.كت*',  
         'احذف النقطة وجرب' 
     ]; 
     }else if (/^هاي$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       '"السلام عليكم" مقصره بشي؟',  
          ' تنتظر مني هايات؟ والله ماقولها  ',  
              ' سلّم او اصمت ',  
               'سلم زين الله يسعدك',  
                'الهاي ذي قلها في قروب ثاني ، هنا تسلم زي الناس والا توكل',  
                 'السلام عليكم ورحمة الله وبركاته*',  
                      ' مايجوز تقول هاي' 
     ]; 
     }else if (/^باي$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'يحفظك ربي ',  
          'معسلامه',  
              ' لا تطول علينا ',  
                  'حيا الله من زار وخفف',  
                      ' لا اصبر خلنا نسولف شوي' 
     ]; 
      }else if (/^سيو$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
          'وتخلني لوحدي ؟',  
           'مع السلامه',  
            'في امان الله',  
             'في حفظ الرحمن',  
              'لاترجعع',  
               'سيو تو',  
                'انتبهلك يا عيون ياتو .',  
                 'عاجبك البعد اللّٰه معك .',  
                  'اخيرا فكنا السبك',  
                   'ياهلا لعد اشوفك',  
                    'تروح وتتركني؟',  
                     'الله معك حبيبي',  
                      'انا اقول طول احسن',  
                       'الحمدلله راح .',  
                        'استودعتك الرحمن',  
                         'وين رايح بدري؟',  
                          'بنتظرك هاه.',  
                           'قفل الباب وراك',  
                            'اذلف',  
                             'روح الله معاك',  
                      'محد بيشتاق لك ترا' 
     ]; 
       }else if (/^بروح|خاطركم$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
          'وتخلني لوحدي ؟',  
           'مع السلامه',  
            'في امان الله',  
             'في حفظ الرحمن',  
              'لاترجعع',  
               'سيو تو',  
                'انتبهلك يا عيون ياتو .',  
                 'عاجبك البعد اللّٰه معك .',  
                  'اخيرا فكنا السبك',  
                   'ياهلا لعد اشوفك',  
                    'تروح وتتركني؟',  
                     'الله معك حبيبي',  
                      'انا اقول طول احسن',  
                       'الحمدلله راح .',  
                        'استودعتك الرحمن',  
                         'وين رايح بدري؟',  
                          'بنتظرك هاه.',  
                           'قفل الباب وراك',  
                            'اذلف',  
                             'روح الله معاك',  
                      'محد بيشتاق لك ترا' 
     ]; 
      }else if (/^تم$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'تتم سعادتك',  
        'تمت افراحك',  
         'الله يتمم افراحك' 
     ]; 
       }else if (/^عادي$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'لا طبعاً مو عادي !!',  
        'صح صح عادي',
          'عادي وشش تستهبل انت؟',  
         'كل شي عندك عادي' 
     ]; 
       }else if (/^وش$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'بعد كل ذا ماتفهم انت؟',  
        'وجع .',  
          'غبي ماتفهم انت؟',  
         'لا تعيد مايستاهل' 
     ]; 
      }else if (/^اتفق$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'جعل مغيرك يتفق',  
        'احلى من يتفق وربي',  
         'اطلق واحلى من اتفق',  
          'كلنا نتفق'
     ]; 
       }else if (/^انشاء الله|إنشاء الله|انشالله|اإنشالله$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'تصحيح : *إن شاء الله*'
     ]; 
       }else if (/^الحمدالله|حمدالله|الحمدله$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'تصحيح : *الحمد لله*'
     ]; 
       }else if (/^اعشقك$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'ايه اعشقك ان كان ماعندك خبر؟',  
       'فديتك مي تو',  
        'اموت فيك',  
         'الله يا حلاوة الشعور💔',  
          'اعشق تفاصيلك',  
           'اهوا عيونك🫂',  
            'شكلي كذا مغروم😢',  
          'انا الي اعشقك يا وجه ملى قلبي سرور❤️'
     ]; 
       }else if (/^فديتك$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
        'فداك كوني ولوني وكامل حناني .',
          'فديت عيونك.',
            'فديتك انا.',
       'فداك الكون والعيون ياعيوني.' 
     ]; 
        }else if (/^ههه$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
        'عسى ماتعبت اصبعك ؟',
       'عسى ماتعبت اصبعك ؟' 
     ]; 
       }else if (/^وينك|فينك$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'لهدرجة ملقوف؟',  
        'في قلبك',  
         'اشتقت؟',  
            'لو يهمك عرفت',  
               'ماراح اعلمك',  
          'مسوي يهمك؟'
     ]; 
       }else if (/^ماش$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'طيب ماش',  
        'الله المستعان',  
         'تفهم',  
            'ندري انه ماش بس نسلك',  
               'نفسيتك الي ماش',  
         'ادري كلهم ماش تحمل',  
         'الشكوى لله',  
         'الله يمشمشك',  
         'اي والله ماش',  
         'فرحان يعني؟',  
         'ماشات',  
         'الحال كذا',  
          'مو شرط يعجبك اظن'
     ]; 
       }else if (/^ها$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'ها وش',  
        'هويت بقلبي',  
          'هويت ببير'
     ]; 
      }else if (/^طيب$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'تطيب ايامك',  
        'تطب طب راسك',  
         'طيب وبعدين ؟',  
          'شاطر',  
           'طاب حالك',  
          'يازين الكلمة منك'
     ]; 
      }else if (/^اها$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'العبب يالتسليك',  
        'يب',  
         'وأخيرا فهمت؟',  
          'فهمني معك دامك فهمت',  
           'فهمت يعني؟',  
            'يحلو الي يفهم',  
             'الحلو شغل مخه وفهم',  
              'لا تسلك',  
              'مسوي غبي؟',  
          'فهمت والا تسلك؟'
     ]; 
     }else if (/^جيت|جييت|رجعت$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'جيت بوقتك عطنا سالفه ',  
          'جانا الخير',  
               'نورتنا',  
                'يا هلا والله',  
                 'أنرت القروب بقدومك',  
                  'اهليين نورت ♥',  
                   'وينك من زمان ؟',  
                    'يالبيه وينك من اول',  
                     'من جابه ذا',  
                      'منور ي عيوني',  
                       'حيو حيو',  
                        'صب القهوة يا ادمن جاك ضيوف',  
                         'احلا من يجي',  
                          'شسوي لك؟',  
                           'منور وربي',  
                            'ارحبووووو',  
                             'جاء الغثيث',  
                              'محد يهتم',  
                               'اطلق من جاء',  
                                'تنتظر ترحيب يعني؟',  
                      ' جاء الحلو جاء وخروا' 
     ]; 
     }else if (/^انقلع$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'ليه ماتذلف انت وتخلصنا ',  
          ' قاعد على راسك عشان انقلع؟  ',  
              ' ماني منقلع انت انقلع ',  
                  'اخاف تبكي بعدي',  
                      ' من بعدك' 
     ]; 
      }else if (/^ياتو تحبني|تحبني|تحبني؟$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'وكيف هُو الحب ان لم يكِن إليك ؟. ',  
          ' وإنْ مِتُّ عِشقاً فأنتِ السَّببْ.  ',  
              ' مو احبك بس اموت فيك ',  
                  'محد يحبك',  
                      ' من انت عشان احبك',
                            'ومن مايحبك ؟',
                                  'قم اذلف بس',
                                        'اي والله واعشقك بعد',
                                              'من جدك انت باقي تسأل اكيد لا',
                                                    'احسك منبوذ ؟',
                                                          'وش ابي في حبك؟',
                                                   'مالقيت الا انا؟',  
                                                    'اكيد لا',  
                                                     'الي مايحبك مايفهم♡',  
                                                      'قمر وماينحب؟',  
                                                       'طحت بغرامك وانا بعز ثباتي',  
                                                        'حاول مرة اخرى',  
                                                         'على حسب انت تحبني؟',  
                                                          'بكل ثانية يزيد حبي لك',
                                                                'بفكر واستخير واشوف'
     ]; 
      }else if (/^احبك|أحبك|ياتو احبك|ياتو أحبك$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'الله لا يرزقني كذبك ',  
                      'احترم شعورك', 
          ' وخر ما ابي احد يحبني ',  
              ' ودي اصدقك بس مقدرت  ',  
                  'كم مرات قلتها اليوم؟',  
                      'حتى انا احبك',
                       ' لا تحتك',
                        'اما انا ماحبك',
                         'احس ماتطمنت',
                          'حبيبي والله اكثر',
                           'يالخفيف هههه',
                                 'لحد يحبني غيرك',
                                       'احلف ؟',
                                             'حبيبي والله اكثر',
                                                   'اموت فيك',
                                                         'اعشقك ياقلبو🧡',
                                                  'الله يحبك',  
                                                   'اي واضح يا كاذب',  
                                                    'حبك برص',  
                                                     'حبتك حيه ابو سبع رؤوس',  
                                                      'يانصااب',  
                                                       'على اساس فارقه معي يعني',  
                                                        'يحظيي',  
                                                         'تيجي نتزوج بالسر',  
                                                          'من متى المعرفه؟',  
                                                           'خوي؟',  
                                                            'كمل كمل صدقت',  
                                                             'لا تدري ام العيال',  
                                                              'كيف المشرفين صابرين عليك للحين؟',  
                                                 'كذاب يحب عشره',  
                                                 'تعال/ي خاص',  
                                                 'اهواك',  
                                                 'يامسلم يكفيك كذب ولعب بالناس',  
                                                 'لا تحبني مو لازم',  
                                                 'فديتك',  
                                                 'استحي لاتحرجني',  
                                                               'وجهك ماهو وجه حب'
     ]; 
      }else if (/^خاص|تعال خاص|خاصك$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'عادي اجي انا؟ ',  
          ' لا تكلم قدامنا ',  
              ' اغار ',  
                  'خذوني معكم',  
               'للرخاص مثلك',  
                'يلا بنسكت لكم هالمره لاتعيدوها',  
                 'لا حول ولا قوة الا بالله ، وبعدين مع هالحركات؟',  
                  'بجي معكم',  
                   'مشينا',  
                    'لاترجعون',  
                      'لا تطولون' 
     ]; 
       }else if (/^طفشان|طفش|ملل|طفشانه$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'اصير لك فعاليه بس اني بوت',  
          'كلنا طفشانين',  
              ' الطفش اللي مخلينا نقابل وجهك يا روحي ',  
                  'عندك سالفه قولها ولا اسكت',  
                   'ارقص لك؟',  
                'اصير لك ملاهي؟',  
                 'كلم الادمن يمكن عنده شي يسليك',  
                  'الطفش ذابحنا والله',  
                   'اوففف شسوي لك؟',  
                    'وش نسوي لك؟',  
                     'قم اقرأ',  
                      'قم ارقص' 
     ]; 
           }else if (/^@967700725811|@967700725811|@967776315086|@967781994494|@967736249487$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'لا تزعج المطور ಠ_ಠ ',  
          ' نايم ',  
              'عجبك مطوري صح؟',  
                  'لا تمنشن مطوري',  
                   'تحب مطوري؟',  
                    'تبي شي اوصله له؟ ', 
                     'فديت مطوري',  
                      'مشغول',  
                       'لا تمنشن',  
                        'ها وش تبي؟ ', 
                         'تبي شي من المطور؟',  
                              'بالمطبخ',  
                      'احب مطوري ♥' 
     ]; 
await conn.sendMessage(m.chat, { react: { text:  "♥" , key: m.key } })
      }else if (/^أكرهك|ياتو اكرهك|اكرهك$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'على اساس ميت فيك يعني؟',  
          'كل يوم اكرهك اكثر',  
              ' جت من الله ',  
               'بموت لو ماحبيتني ترا',  
                'وانا بعد اكرهك',  
                 'مو اكثر مني',  
                  'عسى ماشر ذابح ابوك ؟',  
                   'شعور متبادل',  
                    'ماتحس عيب انك تكره عمك؟',  
                     'احد قال اني احبك اصلا؟',  
                      'احسن',  
                       'محد يحبه وجالس يكره الناس',  
                        'اعطيك بوسه وتحبني؟',  
                         'انت القى احد يحبك بعدين اكره الناس',  
                          'احلى خبر لليوم',  
                           'ليه وش مسوي لك',  
                            'توكل محد مهتم',  
                             'ماطلبتك تحبني',  
                  'ومشاعري طيب؟'
     ]; 
      }else if (/^نتزوج|نرتبط؟|نرتبط|تتزوجني|ياتو نرتبط|ياتو نتزوج|ياتو تتزوجني$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'طيب بس مافيه طلاق و هواش؟',  
          'اليوم قبل بكرة',  
              'رح رح نام بارك الله فيك بزر',  
                  'اي لان احبك',  
                   'لنعم',  
                   'وين موقع بيتكم وكم المهر',  
                    'ناقصين مشاكل احنا',  
                     'عيب عيب',  
                      'المهر على مين',  
                      'ليه خلصوا الحلوين عشان اتزوجك' 
     ]; 
       }else if (/^عيوني|عيني|عيوني$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
       'ماينافس حُبك في قلبي إلا عُيونك .',  
          'الله يحفظها لك',  
              'يازين عيونك',  
                  'لبى عيونك ياروحي',  
                   'يالبى عيونك ياعمري',  
                   'جعلني افداها',  
                    'فديت عيونك',  
                     'احب عيونك',  
                      'ياحلو عيونك',  
                      'تسلم عيونك' 
     ]; 
      }else if (/^كلتبن|كلزق|كل زق|كل تبن$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'حشم بس',  
          'عيب تأدب شوي',  
              ' قدم نفسك ',  
                  'عيبب',  
                   'اكلك واخلي اهلك لمين🦦',  
                    'واك واك عصب',  
                     'جزاك الله خير',  
                      'ياقليل التربيه',  
                       'كلزق انت',  
                        'بعض الناس يحتاج لهم قص لسان',  
                         'الوصاخه لاهلها',  
                          'زق بوجهك',  
                           'طول عمرك مقرف',  
                            'لا تصيح.',  
                             'كلزقين',  
                              'ماكلك ياعيوني',  
                      'قدها؟' 
     ]; 
      }else if (/^الحمد لله$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
                      '♥♥' 
     ]; 
       }else if (/^دوم$/i.test(m.text) && !chat.isBanned) {
      responses = [ 
                      '*يدوم نبضك و قلبك و احساسك و انفاسك و كل خليه فجسمك و يخليك ولا يحرمني منك يدوم نبضك وتدوم ايامك وتدوم احلامك وتدوم حسناتك ويدوم نظرك ويدوم سمعك ويدوم بصرك ويدوم ذوقك و يدوم خشمك ويدوم راسك ويدوم شعرك وتدوم قشرتك ويدوم بطنك ويدوم سرك ويدوم ظهرك وتدوم ركبك وتدوم عيونك وتدوم اذانيك وتدوم طبلتك وتدوم معدتك وتدوم شرايينك ويدوم قلبك ويدوم وريدك ويدوم قفاك وتدوم رموشك وتدوم حواجبك وتدوم جيوبك الانفية وتدوم خدودك وتدوم براطمك وتدوم شفاتك وتدوم لحيتك ويدوم ذقنك ويدوم شاربك وتدوم جمجمتك وتدوم العظمة اللي ع اليمين بجمجمتك وتدوم صلعتك ويدوم فقع الاذن اللي بالجمجمعة وتدوم مناخيرك ويدوم اصبعك الإبهام ويدوم خنصرك وبنصرك ويدوم الوسطى والسبابة ويدوم الشامبو اللي مر بشعررك ويدوم كوعك ويدوم بوعك وتدوم رقبتك وتدوم القصبة الهوائية وتدوم أحبالك الصوتية ويدوم الاكسجين عندك ويدوم الهيدروجين عندك ويدوم شربك للماء ويدوم أكلك للإندومي ويدوم اكلك للمفطح ويدوم اكلك للكبسة*' 
     ]; 
      }else if (/^دز$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'دز امها ',  
          ' دز انت ',  
              ' دزها '
     ]; 
      }else if (/^؟$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'عصب ',  
        'شرايك تروح تنام؟',  
         'ياي خوفتني',  
          'على اساس يعني معصب الحين',  
           'شعندك؟',  
          ' سوي كذا ؟؟ '
     ]; 
      }else if (/^؟؟$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'نمزح',  
        'سوي كذا ؟؟؟',  
          ' روق '
     ]; 
       }else if (/^؟؟؟$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'بسم الله شفيك؟',  
        'احسهم خافو منك',  
         'يازين المعصبين',  
          'دز لااهفك',  
           'استفهام واحد يكفي ترا',  
          ' متفلت انت؟ '
     ]; 
     }else if (/^كفو$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'كفوك الطيب',  
       'يقلبي انت الكفو',  
        'كفوك حبيبي',  
         'الكفو انت والي ربوك',  
                      'ادري اني كفو' 
     ]; 
      }else if (/^نعم$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'نعمة الله عليك',  
       'نعامة ترفسك',  
        'انعم الله عليك',  
         'نعم نعم',  
                      'نعامه' 
     ]; 
       }else if (/^ترفسك$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'ترفسك لحالك',  
       'ترفس عينك لين تفقعها',  
        'ترفس حياتك'
     ]; 
       }else if (/^صح$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'صح صح',  
       'صحين',  
        'صح الله لسانك',  
         'صحن',  
                      'اي صح' 
     ]; 
       }else if (/^تفضل$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'زاد فضلك',  
       'الله يزيد فضلك'
     ]; 
        }else if (/^@31685019045|@31685019045|@31685019045$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       '*عمك🐦🎀*',  
        '*شتبي منه🐦🫳🏻*',  
          '*قاعد ياكل🐦👍*',  
       '*اغار 🐦🥄*'
     ]; 
         }else if (/^@97334623231|@97334623231|@97334623231$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       '*قاعد يطبخ تبي يحط لك بصحن؟*',  
        '*مو فاضي `لك`*',  
          '*راح يزرف جروب وبيرجع*',  
       '*في الحمام*'
     ]; 
          }else if (/^@201070132937|@201070132937|@201070132937$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       '*في الحمام عنده عمليات*',  
        '*وش تبي*',  
          '*خلاص اشغلتنا*',  
       '*راح سوبر نوفا شوي وبجي*'
     ]; 
      }else if (/^تكرهني$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'كلنا نكرهك',  
       'جعل مايكرهك غيري',  
        'التكرار ماينفع كارهك يعني كارهك',  
         'لا احبك',  
            'اكرهك ونص',  
               'اكرهك مدى الحياة',  
                      'اكره الي يكرهك يشيخ' 
     ]; 
       }else if (/^شسالفه|شالسالفه|شسالفة|ايش في|وش في$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'بدينا فضول',  
       'القصة ومافيها ان عيونك حلوة.',  
        'حياك ماغير هبد',  
         'سدئني لو اعرف هقولك',  
            'مدري توي جيت',  
               'انت السالفه',  
                      'يحشون فيك' 
     ]; 
       }else if (/^جوي|جووي$/i.test(m.text) && !chat.isBanned) {
     responses = [ 
       'واجوائي',  
       'انت الي جوي'
     ]; 
       }else if (/^البوت|بوت|بوت|البوت$/i.test(m.text) && !chat.isBanned) {
     await conn.sendMessage(m.chat, { react: { text:  "🇵🇸" , key: m.key } })
           }else if (/^ياتو|ياتو|ياتو|ياتو$/i.test(m.text)) {
   await conn.sendMessage(m.chat, { react: { text:  "💜" , key: m.key } })
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
